content/emacs/configs/14-evil.org
#+TITLE: Evil Mode - Vim Emulation
#+AUTHOR: Kyeong Soo Choi
#+STARTUP: overview
#+OPTIONS: toc:2 num:3
#+PROPERTY: header-args:emacs-lisp :mkdirp yes :results none

Evil mode configuration mirroring my Neovim setup. This is a standalone file for testing - you can either:
1. Tangle with =C-c C-v t= to create =~/.emacs.d/elisp/settings/evil-conf.el=
2. Evaluate individual blocks with =C-c C-c= or the entire buffer with =M-x org-babel-execute-buffer=

*Warning*: This will override many default Emacs keybindings. Test before integrating!

* Evil Core

** Evil Mode

The foundation of Vim emulation in Emacs.

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/evil-conf.el
  ;;; evil-conf.el --- Evil mode configuration -*- lexical-binding: t; -*-
  ;;; Commentary:
  ;; Vim emulation with keybindings mirroring my Neovim config
  ;;; Code:

  (use-package evil
    :ensure t
    :demand t
    :init
    ;; Required before loading evil
    (setq evil-want-integration t)      ; Load evil-collection integrations
    (setq evil-want-keybinding nil)     ; Don't load default keybindings (for evil-collection)
    (setq evil-want-C-u-scroll t)       ; C-u scrolls up like Vim
    (setq evil-want-C-d-scroll t)       ; C-d scrolls down like Vim
    (setq evil-want-C-i-jump t)         ; C-i jumps forward in jump list
    (setq evil-want-Y-yank-to-eol t)    ; Y yanks to end of line (like Neovim)
    (setq evil-want-fine-undo t)        ; More granular undo
    (setq evil-undo-system 'undo-redo)  ; Use Emacs 28+ undo-redo
    (setq evil-respect-visual-line-mode t)
    (setq evil-split-window-below t)    ; Horizontal splits below
    (setq evil-vsplit-window-right t)   ; Vertical splits to the right
    (setq evil-search-module 'evil-search)  ; Use evil's search (supports /)
    (setq evil-ex-search-highlight-all t)

    :config
    (evil-mode 1)

    ;; Set cursor shapes for different states
    (setq evil-normal-state-cursor '(box "DarkGoldenrod2"))
    (setq evil-insert-state-cursor '((bar . 3) "chartreuse3"))
    (setq evil-visual-state-cursor '(box "gray"))
    (setq evil-motion-state-cursor '(box "plum3"))
    (setq evil-replace-state-cursor '((hbar . 4) "red"))
    (setq evil-operator-state-cursor '((hbar . 6) "red"))

    ;; Set initial state for specific modes
    (evil-set-initial-state 'messages-buffer-mode 'normal)
    (evil-set-initial-state 'dashboard-mode 'normal)
    (evil-set-initial-state 'help-mode 'normal)
    (evil-set-initial-state 'Info-mode 'normal)

    ;; Use emacs state (no evil) for terminal and shell modes
    (evil-set-initial-state 'term-mode 'emacs)
    (evil-set-initial-state 'vterm-mode 'emacs)
    (evil-set-initial-state 'eshell-mode 'emacs)
    (evil-set-initial-state 'shell-mode 'emacs)
    (evil-set-initial-state 'comint-mode 'emacs)
    (evil-set-initial-state 'inferior-python-mode 'emacs)
    (evil-set-initial-state 'inferior-emacs-lisp-mode 'emacs))
#+end_src

** Evil Collection

Provides Evil bindings for many Emacs modes.

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/evil-conf.el
(use-package evil-collection
  :after evil
  :ensure t
  :config
  (evil-collection-init))
#+end_src

** Evil Commentary

Comment/uncomment like =gcc= and =gc= in Vim.

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/evil-conf.el
(use-package evil-commentary
  :after evil
  :ensure t
  :diminish
  :config
  (evil-commentary-mode))
#+end_src

** Evil Surround

Surround text objects with pairs (like vim-surround).

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/evil-conf.el
(use-package evil-surround
  :after evil
  :ensure t
  :config
  (global-evil-surround-mode 1))
#+end_src

** Evil Matchit

Enhanced =%== jumping for various languages.

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/evil-conf.el
(use-package evil-matchit
  :after evil
  :ensure t
  :config
  (global-evil-matchit-mode 1))
#+end_src

