emacs/configs/14-evil.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Evil Mode - Vim Emulation</title>
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1"><link rel="stylesheet" href="/assets/styles/style.css"><link rel="stylesheet" href="/assets/styles/toc-sidebar.css"></head>
<body>
<main id="content" class="content">
<h1 class="title">Evil Mode - Vim Emulation</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org8128887">1. Evil Core</a>
<ul>
<li><a href="#orga5896d5">1.1. Evil Mode</a></li>
<li><a href="#org07dee84">1.2. Evil Collection</a></li>
<li><a href="#orga0a2019">1.3. Evil Commentary</a></li>
<li><a href="#org2ee7135">1.4. Evil Surround</a></li>
<li><a href="#org37d757c">1.5. Evil Matchit</a></li>
</ul>
</li>
<li><a href="#org63c6e7f">2. Leader Key Setup</a></li>
<li><a href="#orged03f84">3. Basic Keybindings</a>
<ul>
<li><a href="#orgf3847d6">3.1. Normal Mode Keybindings</a></li>
<li><a href="#orga5bd626">3.2. Insert Mode - Emacs Style</a></li>
<li><a href="#orgebc7010">3.3. Visual Mode</a></li>
<li><a href="#orgef97b2d">3.4. Move Lines (Normal Mode)</a></li>
</ul>
</li>
<li><a href="#org1e15b4a">4. Leader Key Bindings</a>
<ul>
<li><a href="#org0e157f1">4.1. Buffer Management</a></li>
<li><a href="#org241445b">4.2. Window/Split Management</a></li>
<li><a href="#org58d835e">4.3. File Operations</a></li>
<li><a href="#orge89fbb7">4.4. Search (Consult/Vertico)</a></li>
<li><a href="#org1343e01">4.5. Code/LSP Actions</a></li>
<li><a href="#orgb00191d">4.6. LSP/Goto Keybindings</a></li>
<li><a href="#orgb5cbbc5">4.7. Diagnostics Navigation</a></li>
<li><a href="#org4afd9b2">4.8. Toggle Commands</a></li>
<li><a href="#org9ec1372">4.9. Utility Commands</a></li>
<li><a href="#org485adb1">4.10. Delete/Paste Without Yanking</a></li>
</ul>
</li>
<li><a href="#orgaacae7e">5. Additional Packages</a>
<ul>
<li><a href="#org42d3959">5.1. Which-Key Integration</a></li>
<li><a href="#org02abdb1">5.2. Avy (Like Leap in Neovim)</a></li>
</ul>
</li>
<li><a href="#orgba1cfd2">6. File Explorer</a></li>
<li><a href="#org2596bbb">7. Terminal Toggle</a></li>
<li><a href="#orga9e1a36">8. Project Management</a></li>
<li><a href="#orgb7cfa73">9. Git Integration</a></li>
<li><a href="#orge3d6f35">10. Provide Feature</a></li>
<li><a href="#orgb96f58c">11. Usage</a></li>
<li><a href="#org7ab4ca4">12. Key Reference</a></li>
</ul>
</div>
</div>
<p>
Evil mode configuration mirroring my Neovim setup. This is a standalone file for testing - you can either:
</p>
<ol class="org-ol">
<li>Tangle with <code>C-c C-v t</code> to create <code>~/.emacs.d/elisp/settings/evil-conf.el</code></li>
<li>Evaluate individual blocks with <code>C-c C-c</code> or the entire buffer with <code>M-x org-babel-execute-buffer</code></li>
</ol>

<p>
<b>Warning</b>: This will override many default Emacs keybindings. Test before integrating!
</p>

<div id="outline-container-org8128887" class="outline-2">
<h2 id="org8128887"><span class="section-number-2">1.</span> Evil Core</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orga5896d5" class="outline-3">
<h3 id="orga5896d5"><span class="section-number-3">1.1.</span> Evil Mode</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The foundation of Vim emulation in Emacs.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;;; </span><span class="org-comment">evil-conf.el --- Evil mode configuration -*- lexical-binding: t; -*-
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Commentary:
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">Vim emulation with keybindings mirroring my Neovim config
</span><span class="org-comment-delimiter">;;; </span><span class="org-comment">Code:
</span>
(<span class="org-keyword">use-package</span> evil
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:demand</span> t
  <span class="org-builtin">:init</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Required before loading evil
</span>  (<span class="org-keyword">setq</span> evil-want-integration t)      <span class="org-comment-delimiter">; </span><span class="org-comment">Load evil-collection integrations
</span>  (<span class="org-keyword">setq</span> evil-want-keybinding nil)     <span class="org-comment-delimiter">; </span><span class="org-comment">Don't load default keybindings (for evil-collection)
</span>  (<span class="org-keyword">setq</span> evil-want-C-u-scroll t)       <span class="org-comment-delimiter">; </span><span class="org-comment">C-u scrolls up like Vim
</span>  (<span class="org-keyword">setq</span> evil-want-C-d-scroll t)       <span class="org-comment-delimiter">; </span><span class="org-comment">C-d scrolls down like Vim
</span>  (<span class="org-keyword">setq</span> evil-want-C-i-jump t)         <span class="org-comment-delimiter">; </span><span class="org-comment">C-i jumps forward in jump list
</span>  (<span class="org-keyword">setq</span> evil-want-Y-yank-to-eol t)    <span class="org-comment-delimiter">; </span><span class="org-comment">Y yanks to end of line (like Neovim)
</span>  (<span class="org-keyword">setq</span> evil-want-fine-undo t)        <span class="org-comment-delimiter">; </span><span class="org-comment">More granular undo
</span>  (<span class="org-keyword">setq</span> evil-undo-system 'undo-redo)  <span class="org-comment-delimiter">; </span><span class="org-comment">Use Emacs 28+ undo-redo
</span>  (<span class="org-keyword">setq</span> evil-respect-visual-line-mode t)
  (<span class="org-keyword">setq</span> evil-split-window-below t)    <span class="org-comment-delimiter">; </span><span class="org-comment">Horizontal splits below
</span>  (<span class="org-keyword">setq</span> evil-vsplit-window-right t)   <span class="org-comment-delimiter">; </span><span class="org-comment">Vertical splits to the right
</span>  (<span class="org-keyword">setq</span> evil-search-module 'evil-search)  <span class="org-comment-delimiter">; </span><span class="org-comment">Use evil's search (supports /)
</span>  (<span class="org-keyword">setq</span> evil-ex-search-highlight-all t)

  <span class="org-builtin">:config</span>
  (evil-mode 1)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Set cursor shapes for different states
</span>  (<span class="org-keyword">setq</span> evil-normal-state-cursor '(box <span class="org-string">"DarkGoldenrod2"</span>))
  (<span class="org-keyword">setq</span> evil-insert-state-cursor '((bar . 3) <span class="org-string">"chartreuse3"</span>))
  (<span class="org-keyword">setq</span> evil-visual-state-cursor '(box <span class="org-string">"gray"</span>))
  (<span class="org-keyword">setq</span> evil-motion-state-cursor '(box <span class="org-string">"plum3"</span>))
  (<span class="org-keyword">setq</span> evil-replace-state-cursor '((hbar . 4) <span class="org-string">"red"</span>))
  (<span class="org-keyword">setq</span> evil-operator-state-cursor '((hbar . 6) <span class="org-string">"red"</span>))

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Set initial state for specific modes
</span>  (evil-set-initial-state 'messages-buffer-mode 'normal)
  (evil-set-initial-state 'dashboard-mode 'normal)
  (evil-set-initial-state 'help-mode 'normal)
  (evil-set-initial-state 'Info-mode 'normal)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Use emacs state (no evil) for terminal and shell modes
</span>  (evil-set-initial-state 'term-mode 'emacs)
  (evil-set-initial-state 'vterm-mode 'emacs)
  (evil-set-initial-state 'eshell-mode 'emacs)
  (evil-set-initial-state 'shell-mode 'emacs)
  (evil-set-initial-state 'comint-mode 'emacs)
  (evil-set-initial-state 'inferior-python-mode 'emacs)
  (evil-set-initial-state 'inferior-emacs-lisp-mode 'emacs))
</pre>
</div>
</div>
</div>

<div id="outline-container-org07dee84" class="outline-3">
<h3 id="org07dee84"><span class="section-number-3">1.2.</span> Evil Collection</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Provides Evil bindings for many Emacs modes.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> evil-collection
  <span class="org-builtin">:after</span> evil
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (evil-collection-init))
</pre>
</div>
</div>
</div>

<div id="outline-container-orga0a2019" class="outline-3">
<h3 id="orga0a2019"><span class="section-number-3">1.3.</span> Evil Commentary</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Comment/uncomment like <code>gcc</code> and <code>gc</code> in Vim.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> evil-commentary
  <span class="org-builtin">:after</span> evil
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:diminish</span>
  <span class="org-builtin">:config</span>
  (evil-commentary-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-org2ee7135" class="outline-3">
<h3 id="org2ee7135"><span class="section-number-3">1.4.</span> Evil Surround</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Surround text objects with pairs (like vim-surround).
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> evil-surround
  <span class="org-builtin">:after</span> evil
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (global-evil-surround-mode 1))
</pre>
</div>
</div>
</div>

<div id="outline-container-org37d757c" class="outline-3">
<h3 id="org37d757c"><span class="section-number-3">1.5.</span> Evil Matchit</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Enhanced <code>%=</code> jumping for various languages.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> evil-matchit
  <span class="org-builtin">:after</span> evil
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  (global-evil-matchit-mode 1))
</pre>
</div>
</div>
</div>
</div>
