content/emacs/configs/14-evil.org
* Leader Key Setup

Setting up =SPC= as leader key, similar to Neovim config.

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/evil-conf.el
(use-package general
  :ensure t
  :demand t
  :config
  (general-evil-setup t)

  ;; Create leader key definer
  (general-create-definer my/leader-keys
    :keymaps '(normal insert visual emacs)
    :prefix "SPC"
    :global-prefix "C-SPC")  ; For insert mode

  ;; Create local leader key definer
  (general-create-definer my/local-leader-keys
    :keymaps '(normal visual)
    :prefix "SPC m"
    :global-prefix "C-SPC m"))
#+end_src

* Basic Keybindings

** Normal Mode Keybindings

Mirroring Neovim navigation and editing commands.

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/evil-conf.el
;; Center view after search navigation (like Neovim)
(evil-define-key 'normal 'global
  "n" (lambda () (interactive) (evil-search-next) (evil-scroll-line-to-center nil))
  "N" (lambda () (interactive) (evil-search-previous) (evil-scroll-line-to-center nil)))

;; Center view after half-page scrolling
(evil-define-key 'normal 'global
  (kbd "C-d") (lambda () (interactive) (evil-scroll-down nil) (evil-scroll-line-to-center nil))
  (kbd "C-u") (lambda () (interactive) (evil-scroll-up nil) (evil-scroll-line-to-center nil)))

;; Keep cursor position when joining lines
(evil-define-key 'normal 'global
  "J" (lambda () (interactive)
        (let ((col (current-column)))
          (evil-join (line-beginning-position) (line-beginning-position 2))
          (move-to-column col))))

;; C-g as escape (Emacs style in Neovim config)
(define-key evil-normal-state-map (kbd "C-g") 'evil-force-normal-state)
(define-key evil-visual-state-map (kbd "C-g") 'evil-exit-visual-state)
(define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
(define-key evil-replace-state-map (kbd "C-g") 'evil-normal-state)
(define-key evil-operator-state-map (kbd "C-g") 'keyboard-quit)
#+end_src

** Insert Mode - Emacs Style

Your Neovim config has Emacs-style keybindings in insert mode. Here we preserve them.

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/evil-conf.el
;; Exit insert mode quickly
(define-key evil-insert-state-map (kbd "jj") 'evil-normal-state)
(define-key evil-insert-state-map (kbd "jk") 'evil-normal-state)

;; Emacs-style movement in insert mode (like your Neovim config)
(define-key evil-insert-state-map (kbd "C-f") 'forward-char)
(define-key evil-insert-state-map (kbd "C-b") 'backward-char)
(define-key evil-insert-state-map (kbd "C-n") 'next-line)
(define-key evil-insert-state-map (kbd "C-p") 'previous-line)
(define-key evil-insert-state-map (kbd "C-a") 'beginning-of-line)
(define-key evil-insert-state-map (kbd "C-e") 'end-of-line)
(define-key evil-insert-state-map (kbd "M-m") 'back-to-indentation)

;; Word navigation in insert mode
(define-key evil-insert-state-map (kbd "M-f") 'forward-word)
(define-key evil-insert-state-map (kbd "M-b") 'backward-word)
(define-key evil-insert-state-map (kbd "M-<right>") 'forward-word)
(define-key evil-insert-state-map (kbd "M-<left>") 'backward-word)

;; Delete in insert mode
(define-key evil-insert-state-map (kbd "C-d") 'delete-char)
(define-key evil-insert-state-map (kbd "M-d") 'kill-word)
(define-key evil-insert-state-map (kbd "M-<backspace>") 'backward-kill-word)
#+end_src

** Visual Mode

Keep selection after indent like your Neovim config.

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/evil-conf.el
;; Keep visual selection after indent
(define-key evil-visual-state-map (kbd "<") (lambda ()
  (interactive)
  (evil-shift-left (region-beginning) (region-end))
  (evil-normal-state)
  (evil-visual-restore)))

(define-key evil-visual-state-map (kbd ">") (lambda ()
  (interactive)
  (evil-shift-right (region-beginning) (region-end))
  (evil-normal-state)
  (evil-visual-restore)))

;; Move lines in visual mode (like Alt-j/k in Neovim)
(define-key evil-visual-state-map (kbd "M-j") (concat ":m '>+1" (kbd "RET") "gv=gv"))
(define-key evil-visual-state-map (kbd "M-k") (concat ":m '<-2" (kbd "RET") "gv=gv"))
#+end_src

** Move Lines (Normal Mode)

Move lines up/down with Alt-j/k.

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/evil-conf.el
;; Move lines in normal mode
(evil-define-key 'normal 'global
  (kbd "M-j") (lambda () (interactive)
                (evil-move-line-down 1)
                (evil-indent (line-beginning-position) (line-end-position)))
  (kbd "M-k") (lambda () (interactive)
                (evil-move-line-up 1)
                (evil-indent (line-beginning-position) (line-end-position))))

;; Helper functions for line movement
(defun evil-move-line-down (count)
  "Move current line COUNT lines down."
  (let ((col (current-column)))
    (forward-line 1)
    (transpose-lines 1)
    (forward-line -1)
    (move-to-column col)))

(defun evil-move-line-up (count)
  "Move current line COUNT lines up."
  (let ((col (current-column)))
    (transpose-lines 1)
    (forward-line -2)
    (move-to-column col)))
#+end_src

* Leader Key Bindings

