emacs/configs/14-evil.html

<div id="outline-container-org63c6e7f" class="outline-2">
<h2 id="org63c6e7f"><span class="section-number-2">2.</span> Leader Key Setup</h2>
<div class="outline-text-2" id="text-2">
<p>
Setting up <code>SPC</code> as leader key, similar to Neovim config.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> general
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:demand</span> t
  <span class="org-builtin">:config</span>
  (general-evil-setup t)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Create leader key definer
</span>  (general-create-definer my/leader-keys
    <span class="org-builtin">:keymaps</span> '(normal insert visual emacs)
    <span class="org-builtin">:prefix</span> <span class="org-string">"SPC"</span>
    <span class="org-builtin">:global-prefix</span> <span class="org-string">"C-SPC"</span>)  <span class="org-comment-delimiter">; </span><span class="org-comment">For insert mode
</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Create local leader key definer
</span>  (general-create-definer my/local-leader-keys
    <span class="org-builtin">:keymaps</span> '(normal visual)
    <span class="org-builtin">:prefix</span> <span class="org-string">"SPC m"</span>
    <span class="org-builtin">:global-prefix</span> <span class="org-string">"C-SPC m"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-orged03f84" class="outline-2">
<h2 id="orged03f84"><span class="section-number-2">3.</span> Basic Keybindings</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgf3847d6" class="outline-3">
<h3 id="orgf3847d6"><span class="section-number-3">3.1.</span> Normal Mode Keybindings</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Mirroring Neovim navigation and editing commands.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Center view after search navigation (like Neovim)
</span>(evil-define-key 'normal 'global
  <span class="org-string">"n"</span> (<span class="org-keyword">lambda</span> () (<span class="org-keyword">interactive</span>) (evil-search-next) (evil-scroll-line-to-center nil))
  <span class="org-string">"N"</span> (<span class="org-keyword">lambda</span> () (<span class="org-keyword">interactive</span>) (evil-search-previous) (evil-scroll-line-to-center nil)))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Center view after half-page scrolling
</span>(evil-define-key 'normal 'global
  (kbd <span class="org-string">"C-d"</span>) (<span class="org-keyword">lambda</span> () (<span class="org-keyword">interactive</span>) (evil-scroll-down nil) (evil-scroll-line-to-center nil))
  (kbd <span class="org-string">"C-u"</span>) (<span class="org-keyword">lambda</span> () (<span class="org-keyword">interactive</span>) (evil-scroll-up nil) (evil-scroll-line-to-center nil)))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Keep cursor position when joining lines
</span>(evil-define-key 'normal 'global
  <span class="org-string">"J"</span> (<span class="org-keyword">lambda</span> () (<span class="org-keyword">interactive</span>)
        (<span class="org-keyword">let</span> ((col (current-column)))
          (evil-join (line-beginning-position) (line-beginning-position 2))
          (move-to-column col))))

<span class="org-comment-delimiter">;; </span><span class="org-comment">C-g as escape (Emacs style in Neovim config)
</span>(define-key evil-normal-state-map (kbd <span class="org-string">"C-g"</span>) 'evil-force-normal-state)
(define-key evil-visual-state-map (kbd <span class="org-string">"C-g"</span>) 'evil-exit-visual-state)
(define-key evil-insert-state-map (kbd <span class="org-string">"C-g"</span>) 'evil-normal-state)
(define-key evil-replace-state-map (kbd <span class="org-string">"C-g"</span>) 'evil-normal-state)
(define-key evil-operator-state-map (kbd <span class="org-string">"C-g"</span>) 'keyboard-quit)
</pre>
</div>
</div>
</div>

<div id="outline-container-orga5bd626" class="outline-3">
<h3 id="orga5bd626"><span class="section-number-3">3.2.</span> Insert Mode - Emacs Style</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Your Neovim config has Emacs-style keybindings in insert mode. Here we preserve them.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Exit insert mode quickly
</span>(define-key evil-insert-state-map (kbd <span class="org-string">"jj"</span>) 'evil-normal-state)
(define-key evil-insert-state-map (kbd <span class="org-string">"jk"</span>) 'evil-normal-state)

<span class="org-comment-delimiter">;; </span><span class="org-comment">Emacs-style movement in insert mode (like your Neovim config)
</span>(define-key evil-insert-state-map (kbd <span class="org-string">"C-f"</span>) 'forward-char)
(define-key evil-insert-state-map (kbd <span class="org-string">"C-b"</span>) 'backward-char)
(define-key evil-insert-state-map (kbd <span class="org-string">"C-n"</span>) 'next-line)
(define-key evil-insert-state-map (kbd <span class="org-string">"C-p"</span>) 'previous-line)
(define-key evil-insert-state-map (kbd <span class="org-string">"C-a"</span>) 'beginning-of-line)
(define-key evil-insert-state-map (kbd <span class="org-string">"C-e"</span>) 'end-of-line)
(define-key evil-insert-state-map (kbd <span class="org-string">"M-m"</span>) 'back-to-indentation)

<span class="org-comment-delimiter">;; </span><span class="org-comment">Word navigation in insert mode
</span>(define-key evil-insert-state-map (kbd <span class="org-string">"M-f"</span>) 'forward-word)
(define-key evil-insert-state-map (kbd <span class="org-string">"M-b"</span>) 'backward-word)
(define-key evil-insert-state-map (kbd <span class="org-string">"M-&lt;right&gt;"</span>) 'forward-word)
(define-key evil-insert-state-map (kbd <span class="org-string">"M-&lt;left&gt;"</span>) 'backward-word)

<span class="org-comment-delimiter">;; </span><span class="org-comment">Delete in insert mode
</span>(define-key evil-insert-state-map (kbd <span class="org-string">"C-d"</span>) 'delete-char)
(define-key evil-insert-state-map (kbd <span class="org-string">"M-d"</span>) 'kill-word)
(define-key evil-insert-state-map (kbd <span class="org-string">"M-&lt;backspace&gt;"</span>) 'backward-kill-word)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgebc7010" class="outline-3">
<h3 id="orgebc7010"><span class="section-number-3">3.3.</span> Visual Mode</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Keep selection after indent like your Neovim config.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Keep visual selection after indent
</span>(define-key evil-visual-state-map (kbd <span class="org-string">"&lt;"</span>) (<span class="org-keyword">lambda</span> ()
  (<span class="org-keyword">interactive</span>)
  (evil-shift-left (region-beginning) (region-end))
  (evil-normal-state)
  (evil-visual-restore)))

(define-key evil-visual-state-map (kbd <span class="org-string">"&gt;"</span>) (<span class="org-keyword">lambda</span> ()
  (<span class="org-keyword">interactive</span>)
  (evil-shift-right (region-beginning) (region-end))
  (evil-normal-state)
  (evil-visual-restore)))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Move lines in visual mode (like Alt-j/k in Neovim)
</span>(define-key evil-visual-state-map (kbd <span class="org-string">"M-j"</span>) (concat <span class="org-string">":m '&gt;+1"</span> (kbd <span class="org-string">"RET"</span>) <span class="org-string">"gv=gv"</span>))
(define-key evil-visual-state-map (kbd <span class="org-string">"M-k"</span>) (concat <span class="org-string">":m '&lt;-2"</span> (kbd <span class="org-string">"RET"</span>) <span class="org-string">"gv=gv"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgef97b2d" class="outline-3">
<h3 id="orgef97b2d"><span class="section-number-3">3.4.</span> Move Lines (Normal Mode)</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Move lines up/down with Alt-j/k.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Move lines in normal mode
</span>(evil-define-key 'normal 'global
  (kbd <span class="org-string">"M-j"</span>) (<span class="org-keyword">lambda</span> () (<span class="org-keyword">interactive</span>)
                (evil-move-line-down 1)
                (evil-indent (line-beginning-position) (line-end-position)))
  (kbd <span class="org-string">"M-k"</span>) (<span class="org-keyword">lambda</span> () (<span class="org-keyword">interactive</span>)
                (evil-move-line-up 1)
                (evil-indent (line-beginning-position) (line-end-position))))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Helper functions for line movement
</span>(<span class="org-keyword">defun</span> <span class="org-function-name">evil-move-line-down</span> (count)
  <span class="org-doc">"Move current line COUNT lines down."</span>
  (<span class="org-keyword">let</span> ((col (current-column)))
    (forward-line 1)
    (transpose-lines 1)
    (forward-line -1)
    (move-to-column col)))

(<span class="org-keyword">defun</span> <span class="org-function-name">evil-move-line-up</span> (count)
  <span class="org-doc">"Move current line COUNT lines up."</span>
  (<span class="org-keyword">let</span> ((col (current-column)))
    (transpose-lines 1)
    (forward-line -2)
    (move-to-column col)))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org1e15b4a" class="outline-2">
<h2 id="org1e15b4a"><span class="section-number-2">4.</span> Leader Key Bindings</h2>
<div class="outline-text-2" id="text-4">
</div>
