content/emacs/configs/14-evil.org
** Buffer Management

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/evil-conf.el
(my/leader-keys
  ;; Buffer navigation (like Neovim <leader>] and <leader>[)
  "]" '(next-buffer :which-key "next buffer")
  "[" '(previous-buffer :which-key "prev buffer")
  "k" '(kill-current-buffer :which-key "kill buffer")

  ;; Buffer submenu
  "b" '(:ignore t :which-key "buffer")
  "bb" '(consult-buffer :which-key "switch buffer")
  "bd" '(kill-current-buffer :which-key "kill buffer")
  "bn" '(next-buffer :which-key "next buffer")
  "bp" '(previous-buffer :which-key "prev buffer")
  "br" '(revert-buffer :which-key "revert buffer")
  "bs" '(save-buffer :which-key "save buffer"))
#+end_src

** Window/Split Management

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/evil-conf.el
(my/leader-keys
  ;; Window splits (like Neovim)
  "|" '(split-window-right :which-key "vsplit")
  "3" '(split-window-right :which-key "vsplit")
  "_" '(split-window-below :which-key "hsplit")
  "2" '(split-window-below :which-key "hsplit")
  "1" '(delete-other-windows :which-key "maximize")
  "0" '(delete-window :which-key "close window")
  "o" '(other-window :which-key "other window")

  ;; Window submenu
  "w" '(:ignore t :which-key "window")
  "wh" '(evil-window-left :which-key "left")
  "wj" '(evil-window-down :which-key "down")
  "wk" '(evil-window-up :which-key "up")
  "wl" '(evil-window-right :which-key "right")
  "ws" '(split-window-below :which-key "hsplit")
  "wv" '(split-window-right :which-key "vsplit")
  "wd" '(delete-window :which-key "close")
  "wm" '(delete-other-windows :which-key "maximize")
  "w=" '(balance-windows :which-key "balance"))

;; Window resizing (like Neovim C-Arrow)
(define-key evil-normal-state-map (kbd "C-<up>") 'enlarge-window)
(define-key evil-normal-state-map (kbd "C-<down>") 'shrink-window)
(define-key evil-normal-state-map (kbd "C-<left>") 'shrink-window-horizontally)
(define-key evil-normal-state-map (kbd "C-<right>") 'enlarge-window-horizontally)
#+end_src

** File Operations

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/evil-conf.el
(my/leader-keys
  "f" '(:ignore t :which-key "file")
  "ff" '(find-file :which-key "find file")
  "fr" '(consult-recent-file :which-key "recent files")
  "fs" '(save-buffer :which-key "save file")
  "fS" '(write-file :which-key "save as")
  "fe" '((lambda () (interactive) (find-file user-init-file)) :which-key "edit config")
  "fR" '((lambda () (interactive) (load-file user-init-file)) :which-key "reload config"))
#+end_src

** Search (Consult/Vertico)

These bindings mirror Telescope from Neovim. Requires consult package.

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/evil-conf.el
(my/leader-keys
  ;; Search prefix (like Neovim <leader>f for telescope)
  "s" '(:ignore t :which-key "search")
  "sf" '(consult-find :which-key "find files")
  "sg" '(consult-ripgrep :which-key "ripgrep")
  "sb" '(consult-buffer :which-key "buffers")
  "sh" '(consult-info :which-key "help")
  "sm" '(consult-mark :which-key "marks")
  "sr" '(consult-register :which-key "registers")
  "sl" '(consult-line :which-key "search lines")
  "si" '(consult-imenu :which-key "imenu")
  "so" '(consult-outline :which-key "outline")

  ;; Direct search (like telescope's most used)
  "/" '(consult-line :which-key "search buffer")
  "SPC" '(consult-buffer :which-key "switch buffer"))
#+end_src

** Code/LSP Actions

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/evil-conf.el
(my/leader-keys
  ;; Code actions (like Neovim LSP bindings)
  "c" '(:ignore t :which-key "code")
  "ca" '(eglot-code-actions :which-key "code actions")
  "cr" '(eglot-rename :which-key "rename")
  "cf" '(eglot-format-buffer :which-key "format buffer")
  "ci" '(eglot-find-implementation :which-key "implementation")
  "cd" '(eglot-find-declaration :which-key "declaration")
  "ct" '(eglot-find-typeDefinition :which-key "type definition")

  ;; Quick rename (like Neovim <leader>rn)
  "rn" '(eglot-rename :which-key "rename"))
#+end_src

