emacs/configs/14-evil.html
<div id="outline-container-org0e157f1" class="outline-3">
<h3 id="org0e157f1"><span class="section-number-3">4.1.</span> Buffer Management</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(my/leader-keys
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Buffer navigation (like Neovim &lt;leader&gt;] and &lt;leader&gt;[)
</span>  <span class="org-string">"]"</span> '(next-buffer <span class="org-builtin">:which-key</span> <span class="org-string">"next buffer"</span>)
  <span class="org-string">"["</span> '(previous-buffer <span class="org-builtin">:which-key</span> <span class="org-string">"prev buffer"</span>)
  <span class="org-string">"k"</span> '(kill-current-buffer <span class="org-builtin">:which-key</span> <span class="org-string">"kill buffer"</span>)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Buffer submenu
</span>  <span class="org-string">"b"</span> '(<span class="org-builtin">:ignore</span> t <span class="org-builtin">:which-key</span> <span class="org-string">"buffer"</span>)
  <span class="org-string">"bb"</span> '(consult-buffer <span class="org-builtin">:which-key</span> <span class="org-string">"switch buffer"</span>)
  <span class="org-string">"bd"</span> '(kill-current-buffer <span class="org-builtin">:which-key</span> <span class="org-string">"kill buffer"</span>)
  <span class="org-string">"bn"</span> '(next-buffer <span class="org-builtin">:which-key</span> <span class="org-string">"next buffer"</span>)
  <span class="org-string">"bp"</span> '(previous-buffer <span class="org-builtin">:which-key</span> <span class="org-string">"prev buffer"</span>)
  <span class="org-string">"br"</span> '(revert-buffer <span class="org-builtin">:which-key</span> <span class="org-string">"revert buffer"</span>)
  <span class="org-string">"bs"</span> '(save-buffer <span class="org-builtin">:which-key</span> <span class="org-string">"save buffer"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-org241445b" class="outline-3">
<h3 id="org241445b"><span class="section-number-3">4.2.</span> Window/Split Management</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(my/leader-keys
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Window splits (like Neovim)
</span>  <span class="org-string">"|"</span> '(split-window-right <span class="org-builtin">:which-key</span> <span class="org-string">"vsplit"</span>)
  <span class="org-string">"3"</span> '(split-window-right <span class="org-builtin">:which-key</span> <span class="org-string">"vsplit"</span>)
  <span class="org-string">"_"</span> '(split-window-below <span class="org-builtin">:which-key</span> <span class="org-string">"hsplit"</span>)
  <span class="org-string">"2"</span> '(split-window-below <span class="org-builtin">:which-key</span> <span class="org-string">"hsplit"</span>)
  <span class="org-string">"1"</span> '(delete-other-windows <span class="org-builtin">:which-key</span> <span class="org-string">"maximize"</span>)
  <span class="org-string">"0"</span> '(delete-window <span class="org-builtin">:which-key</span> <span class="org-string">"close window"</span>)
  <span class="org-string">"o"</span> '(other-window <span class="org-builtin">:which-key</span> <span class="org-string">"other window"</span>)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Window submenu
</span>  <span class="org-string">"w"</span> '(<span class="org-builtin">:ignore</span> t <span class="org-builtin">:which-key</span> <span class="org-string">"window"</span>)
  <span class="org-string">"wh"</span> '(evil-window-left <span class="org-builtin">:which-key</span> <span class="org-string">"left"</span>)
  <span class="org-string">"wj"</span> '(evil-window-down <span class="org-builtin">:which-key</span> <span class="org-string">"down"</span>)
  <span class="org-string">"wk"</span> '(evil-window-up <span class="org-builtin">:which-key</span> <span class="org-string">"up"</span>)
  <span class="org-string">"wl"</span> '(evil-window-right <span class="org-builtin">:which-key</span> <span class="org-string">"right"</span>)
  <span class="org-string">"ws"</span> '(split-window-below <span class="org-builtin">:which-key</span> <span class="org-string">"hsplit"</span>)
  <span class="org-string">"wv"</span> '(split-window-right <span class="org-builtin">:which-key</span> <span class="org-string">"vsplit"</span>)
  <span class="org-string">"wd"</span> '(delete-window <span class="org-builtin">:which-key</span> <span class="org-string">"close"</span>)
  <span class="org-string">"wm"</span> '(delete-other-windows <span class="org-builtin">:which-key</span> <span class="org-string">"maximize"</span>)
  <span class="org-string">"w="</span> '(balance-windows <span class="org-builtin">:which-key</span> <span class="org-string">"balance"</span>))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Window resizing (like Neovim C-Arrow)
</span>(define-key evil-normal-state-map (kbd <span class="org-string">"C-&lt;up&gt;"</span>) 'enlarge-window)
(define-key evil-normal-state-map (kbd <span class="org-string">"C-&lt;down&gt;"</span>) 'shrink-window)
(define-key evil-normal-state-map (kbd <span class="org-string">"C-&lt;left&gt;"</span>) 'shrink-window-horizontally)
(define-key evil-normal-state-map (kbd <span class="org-string">"C-&lt;right&gt;"</span>) 'enlarge-window-horizontally)
</pre>
</div>
</div>
</div>

<div id="outline-container-org58d835e" class="outline-3">
<h3 id="org58d835e"><span class="section-number-3">4.3.</span> File Operations</h3>
<div class="outline-text-3" id="text-4-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(my/leader-keys
  <span class="org-string">"f"</span> '(<span class="org-builtin">:ignore</span> t <span class="org-builtin">:which-key</span> <span class="org-string">"file"</span>)
  <span class="org-string">"ff"</span> '(find-file <span class="org-builtin">:which-key</span> <span class="org-string">"find file"</span>)
  <span class="org-string">"fr"</span> '(consult-recent-file <span class="org-builtin">:which-key</span> <span class="org-string">"recent files"</span>)
  <span class="org-string">"fs"</span> '(save-buffer <span class="org-builtin">:which-key</span> <span class="org-string">"save file"</span>)
  <span class="org-string">"fS"</span> '(write-file <span class="org-builtin">:which-key</span> <span class="org-string">"save as"</span>)
  <span class="org-string">"fe"</span> '((<span class="org-keyword">lambda</span> () (<span class="org-keyword">interactive</span>) (find-file user-init-file)) <span class="org-builtin">:which-key</span> <span class="org-string">"edit config"</span>)
  <span class="org-string">"fR"</span> '((<span class="org-keyword">lambda</span> () (<span class="org-keyword">interactive</span>) (load-file user-init-file)) <span class="org-builtin">:which-key</span> <span class="org-string">"reload config"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-orge89fbb7" class="outline-3">
<h3 id="orge89fbb7"><span class="section-number-3">4.4.</span> Search (Consult/Vertico)</h3>
<div class="outline-text-3" id="text-4-4">
<p>
These bindings mirror Telescope from Neovim. Requires consult package.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(my/leader-keys
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Search prefix (like Neovim &lt;leader&gt;f for telescope)
</span>  <span class="org-string">"s"</span> '(<span class="org-builtin">:ignore</span> t <span class="org-builtin">:which-key</span> <span class="org-string">"search"</span>)
  <span class="org-string">"sf"</span> '(consult-find <span class="org-builtin">:which-key</span> <span class="org-string">"find files"</span>)
  <span class="org-string">"sg"</span> '(consult-ripgrep <span class="org-builtin">:which-key</span> <span class="org-string">"ripgrep"</span>)
  <span class="org-string">"sb"</span> '(consult-buffer <span class="org-builtin">:which-key</span> <span class="org-string">"buffers"</span>)
  <span class="org-string">"sh"</span> '(consult-info <span class="org-builtin">:which-key</span> <span class="org-string">"help"</span>)
  <span class="org-string">"sm"</span> '(consult-mark <span class="org-builtin">:which-key</span> <span class="org-string">"marks"</span>)
  <span class="org-string">"sr"</span> '(consult-register <span class="org-builtin">:which-key</span> <span class="org-string">"registers"</span>)
  <span class="org-string">"sl"</span> '(consult-line <span class="org-builtin">:which-key</span> <span class="org-string">"search lines"</span>)
  <span class="org-string">"si"</span> '(consult-imenu <span class="org-builtin">:which-key</span> <span class="org-string">"imenu"</span>)
  <span class="org-string">"so"</span> '(consult-outline <span class="org-builtin">:which-key</span> <span class="org-string">"outline"</span>)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Direct search (like telescope's most used)
</span>  <span class="org-string">"/"</span> '(consult-line <span class="org-builtin">:which-key</span> <span class="org-string">"search buffer"</span>)
  <span class="org-string">"SPC"</span> '(consult-buffer <span class="org-builtin">:which-key</span> <span class="org-string">"switch buffer"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-org1343e01" class="outline-3">
<h3 id="org1343e01"><span class="section-number-3">4.5.</span> Code/LSP Actions</h3>
<div class="outline-text-3" id="text-4-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(my/leader-keys
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Code actions (like Neovim LSP bindings)
</span>  <span class="org-string">"c"</span> '(<span class="org-builtin">:ignore</span> t <span class="org-builtin">:which-key</span> <span class="org-string">"code"</span>)
  <span class="org-string">"ca"</span> '(eglot-code-actions <span class="org-builtin">:which-key</span> <span class="org-string">"code actions"</span>)
  <span class="org-string">"cr"</span> '(eglot-rename <span class="org-builtin">:which-key</span> <span class="org-string">"rename"</span>)
  <span class="org-string">"cf"</span> '(eglot-format-buffer <span class="org-builtin">:which-key</span> <span class="org-string">"format buffer"</span>)
  <span class="org-string">"ci"</span> '(eglot-find-implementation <span class="org-builtin">:which-key</span> <span class="org-string">"implementation"</span>)
  <span class="org-string">"cd"</span> '(eglot-find-declaration <span class="org-builtin">:which-key</span> <span class="org-string">"declaration"</span>)
  <span class="org-string">"ct"</span> '(eglot-find-typeDefinition <span class="org-builtin">:which-key</span> <span class="org-string">"type definition"</span>)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Quick rename (like Neovim &lt;leader&gt;rn)
</span>  <span class="org-string">"rn"</span> '(eglot-rename <span class="org-builtin">:which-key</span> <span class="org-string">"rename"</span>))
</pre>
</div>
</div>
</div>
