content/emacs/configs/14-evil.org
** LSP/Goto Keybindings

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/evil-conf.el
;; Go to bindings (like Neovim g prefix)
(evil-define-key 'normal 'global
  "gd" 'xref-find-definitions
  "gD" 'eglot-find-declaration
  "gr" 'xref-find-references
  "gi" 'eglot-find-implementation
  "K"  'eldoc-box-help-at-point)  ; or eldoc-doc-buffer if eldoc-box not installed
#+end_src

** Diagnostics Navigation

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/evil-conf.el
;; Diagnostic navigation (like Neovim ]d [d)
(evil-define-key 'normal 'global
  "]d" 'flymake-goto-next-error
  "[d" 'flymake-goto-prev-error
  "]q" 'next-error
  "[q" 'previous-error)

(my/leader-keys
  "e" '(:ignore t :which-key "errors")
  "el" '(flymake-show-buffer-diagnostics :which-key "list errors")
  "eL" '(flymake-show-project-diagnostics :which-key "project errors"))
#+end_src

** Toggle Commands

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/evil-conf.el
(my/leader-keys
  "t" '(:ignore t :which-key "toggle")
  "tt" '(toggle-truncate-lines :which-key "truncate lines")
  "tn" '(display-line-numbers-mode :which-key "line numbers")
  "tw" '(whitespace-mode :which-key "whitespace")
  "ts" '((lambda () (interactive) (setq-local spell-checking-enabled
                                              (not (bound-and-true-p flyspell-mode)))
           (if spell-checking-enabled (flyspell-mode 1) (flyspell-mode -1)))
         :which-key "spell check"))
#+end_src

** Utility Commands

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/evil-conf.el
(my/leader-keys
  ;; Clear search highlight (like Neovim <leader>c)
  "h" '(evil-ex-nohighlight :which-key "clear highlight")

  ;; Help prefix
  "?" '(:ignore t :which-key "help")
  "?f" '(describe-function :which-key "describe function")
  "?v" '(describe-variable :which-key "describe variable")
  "?k" '(describe-key :which-key "describe key")
  "?m" '(describe-mode :which-key "describe mode")

  ;; Quit
  "q" '(:ignore t :which-key "quit")
  "qq" '(save-buffers-kill-terminal :which-key "quit emacs")
  "qQ" '(kill-emacs :which-key "quit without saving"))
#+end_src

** Delete/Paste Without Yanking

Like your Neovim =<leader>d= and =<leader>p= bindings.

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/evil-conf.el
;; Delete to black hole register (like Neovim <leader>d)
(my/leader-keys
  "d" '(("_d") :which-key "delete no yank"))

(evil-define-key 'normal 'global
  (kbd "<leader>d") (lambda () (interactive)
                      (evil-use-register ?_)
                      (call-interactively 'evil-delete)))

(evil-define-key 'visual 'global
  (kbd "<leader>d") (lambda () (interactive)
                      (evil-use-register ?_)
                      (call-interactively 'evil-delete)))

;; Paste without yanking replaced text (like Neovim <leader>p)
(evil-define-key 'visual 'global
  (kbd "<leader>p") (lambda () (interactive)
                      (evil-use-register ?_)
                      (evil-delete (region-beginning) (region-end))
                      (evil-paste-before 1)))
#+end_src

* Additional Packages

** Which-Key Integration

Shows available keybindings in a popup.

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/evil-conf.el
(use-package which-key
  :ensure t
  :diminish
  :init
  (setq which-key-separator " ")
  (setq which-key-prefix-prefix "+")
  (setq which-key-idle-delay 0.3)
  (setq which-key-sort-order 'which-key-key-order-alpha)
  :config
  (which-key-mode))
#+end_src

** Avy (Like Leap in Neovim)

Quick navigation with =s= and =S=.

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/evil-conf.el
(use-package avy
  :ensure t
  :config
  ;; Use similar keybindings to Leap in Neovim
  (evil-define-key 'normal 'global
    "s" 'avy-goto-char-2
    "S" 'avy-goto-line
    "gs" 'avy-goto-char-timer)
  (evil-define-key 'visual 'global
    "s" 'avy-goto-char-2
    "S" 'avy-goto-line)
  (evil-define-key 'operator 'global
    "s" 'avy-goto-char-2)

  (setq avy-background t)
  (setq avy-style 'at-full)
  (setq avy-timeout-seconds 0.3))
#+end_src

* File Explorer

Dired or Treemacs toggle with =<leader>e=.

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/evil-conf.el
  ;; Toggle file explorer (like Neovim <leader>e for Neo-tree)
  ;; (my/leader-keys
  ;;   "e" '(dired-jump :which-key "file explorer"))

  ;; If you prefer treemacs, uncomment:
  (use-package treemacs-evil
    :after (treemacs evil)
    :ensure t)
  (my/leader-keys
    "e" '(treemacs :which-key "file explorer"))
#+end_src

