emacs/configs/14-evil.html

<div id="outline-container-orgb00191d" class="outline-3">
<h3 id="orgb00191d"><span class="section-number-3">4.6.</span> LSP/Goto Keybindings</h3>
<div class="outline-text-3" id="text-4-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Go to bindings (like Neovim g prefix)
</span>(evil-define-key 'normal 'global
  <span class="org-string">"gd"</span> 'xref-find-definitions
  <span class="org-string">"gD"</span> 'eglot-find-declaration
  <span class="org-string">"gr"</span> 'xref-find-references
  <span class="org-string">"gi"</span> 'eglot-find-implementation
  <span class="org-string">"K"</span>  'eldoc-box-help-at-point)  <span class="org-comment-delimiter">; </span><span class="org-comment">or eldoc-doc-buffer if eldoc-box not installed</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb5cbbc5" class="outline-3">
<h3 id="orgb5cbbc5"><span class="section-number-3">4.7.</span> Diagnostics Navigation</h3>
<div class="outline-text-3" id="text-4-7">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Diagnostic navigation (like Neovim ]d [d)
</span>(evil-define-key 'normal 'global
  <span class="org-string">"]d"</span> 'flymake-goto-next-error
  <span class="org-string">"[d"</span> 'flymake-goto-prev-error
  <span class="org-string">"]q"</span> 'next-error
  <span class="org-string">"[q"</span> 'previous-error)

(my/leader-keys
  <span class="org-string">"e"</span> '(<span class="org-builtin">:ignore</span> t <span class="org-builtin">:which-key</span> <span class="org-string">"errors"</span>)
  <span class="org-string">"el"</span> '(flymake-show-buffer-diagnostics <span class="org-builtin">:which-key</span> <span class="org-string">"list errors"</span>)
  <span class="org-string">"eL"</span> '(flymake-show-project-diagnostics <span class="org-builtin">:which-key</span> <span class="org-string">"project errors"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-org4afd9b2" class="outline-3">
<h3 id="org4afd9b2"><span class="section-number-3">4.8.</span> Toggle Commands</h3>
<div class="outline-text-3" id="text-4-8">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(my/leader-keys
  <span class="org-string">"t"</span> '(<span class="org-builtin">:ignore</span> t <span class="org-builtin">:which-key</span> <span class="org-string">"toggle"</span>)
  <span class="org-string">"tt"</span> '(toggle-truncate-lines <span class="org-builtin">:which-key</span> <span class="org-string">"truncate lines"</span>)
  <span class="org-string">"tn"</span> '(display-line-numbers-mode <span class="org-builtin">:which-key</span> <span class="org-string">"line numbers"</span>)
  <span class="org-string">"tw"</span> '(whitespace-mode <span class="org-builtin">:which-key</span> <span class="org-string">"whitespace"</span>)
  <span class="org-string">"ts"</span> '((<span class="org-keyword">lambda</span> () (<span class="org-keyword">interactive</span>) (<span class="org-keyword">setq-local</span> spell-checking-enabled
                                              (not (<span class="org-keyword">bound-and-true-p</span> flyspell-mode)))
           (<span class="org-keyword">if</span> spell-checking-enabled (flyspell-mode 1) (flyspell-mode -1)))
         <span class="org-builtin">:which-key</span> <span class="org-string">"spell check"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-org9ec1372" class="outline-3">
<h3 id="org9ec1372"><span class="section-number-3">4.9.</span> Utility Commands</h3>
<div class="outline-text-3" id="text-4-9">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(my/leader-keys
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Clear search highlight (like Neovim &lt;leader&gt;c)
</span>  <span class="org-string">"h"</span> '(evil-ex-nohighlight <span class="org-builtin">:which-key</span> <span class="org-string">"clear highlight"</span>)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Help prefix
</span>  <span class="org-string">"?"</span> '(<span class="org-builtin">:ignore</span> t <span class="org-builtin">:which-key</span> <span class="org-string">"help"</span>)
  <span class="org-string">"?f"</span> '(describe-function <span class="org-builtin">:which-key</span> <span class="org-string">"describe function"</span>)
  <span class="org-string">"?v"</span> '(describe-variable <span class="org-builtin">:which-key</span> <span class="org-string">"describe variable"</span>)
  <span class="org-string">"?k"</span> '(describe-key <span class="org-builtin">:which-key</span> <span class="org-string">"describe key"</span>)
  <span class="org-string">"?m"</span> '(describe-mode <span class="org-builtin">:which-key</span> <span class="org-string">"describe mode"</span>)

  <span class="org-comment-delimiter">;; </span><span class="org-comment">Quit
</span>  <span class="org-string">"q"</span> '(<span class="org-builtin">:ignore</span> t <span class="org-builtin">:which-key</span> <span class="org-string">"quit"</span>)
  <span class="org-string">"qq"</span> '(save-buffers-kill-terminal <span class="org-builtin">:which-key</span> <span class="org-string">"quit emacs"</span>)
  <span class="org-string">"qQ"</span> '(kill-emacs <span class="org-builtin">:which-key</span> <span class="org-string">"quit without saving"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-org485adb1" class="outline-3">
<h3 id="org485adb1"><span class="section-number-3">4.10.</span> Delete/Paste Without Yanking</h3>
<div class="outline-text-3" id="text-4-10">
<p>
Like your Neovim <code>&lt;leader&gt;d</code> and <code>&lt;leader&gt;p</code> bindings.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Delete to black hole register (like Neovim &lt;leader&gt;d)
</span>(my/leader-keys
  <span class="org-string">"d"</span> '((<span class="org-string">"_d"</span>) <span class="org-builtin">:which-key</span> <span class="org-string">"delete no yank"</span>))

(evil-define-key 'normal 'global
  (kbd <span class="org-string">"&lt;leader&gt;d"</span>) (<span class="org-keyword">lambda</span> () (<span class="org-keyword">interactive</span>)
                      (evil-use-register ?_)
                      (call-interactively 'evil-delete)))

(evil-define-key 'visual 'global
  (kbd <span class="org-string">"&lt;leader&gt;d"</span>) (<span class="org-keyword">lambda</span> () (<span class="org-keyword">interactive</span>)
                      (evil-use-register ?_)
                      (call-interactively 'evil-delete)))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Paste without yanking replaced text (like Neovim &lt;leader&gt;p)
</span>(evil-define-key 'visual 'global
  (kbd <span class="org-string">"&lt;leader&gt;p"</span>) (<span class="org-keyword">lambda</span> () (<span class="org-keyword">interactive</span>)
                      (evil-use-register ?_)
                      (evil-delete (region-beginning) (region-end))
                      (evil-paste-before 1)))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgaacae7e" class="outline-2">
<h2 id="orgaacae7e"><span class="section-number-2">5.</span> Additional Packages</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org42d3959" class="outline-3">
<h3 id="org42d3959"><span class="section-number-3">5.1.</span> Which-Key Integration</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Shows available keybindings in a popup.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> which-key
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:diminish</span>
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">setq</span> which-key-separator <span class="org-string">" "</span>)
  (<span class="org-keyword">setq</span> which-key-prefix-prefix <span class="org-string">"+"</span>)
  (<span class="org-keyword">setq</span> which-key-idle-delay 0.3)
  (<span class="org-keyword">setq</span> which-key-sort-order 'which-key-key-order-alpha)
  <span class="org-builtin">:config</span>
  (which-key-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-org02abdb1" class="outline-3">
<h3 id="org02abdb1"><span class="section-number-3">5.2.</span> Avy (Like Leap in Neovim)</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Quick navigation with <code>s</code> and <code>S</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">use-package</span> avy
  <span class="org-builtin">:ensure</span> t
  <span class="org-builtin">:config</span>
  <span class="org-comment-delimiter">;; </span><span class="org-comment">Use similar keybindings to Leap in Neovim
</span>  (evil-define-key 'normal 'global
    <span class="org-string">"s"</span> 'avy-goto-char-2
    <span class="org-string">"S"</span> 'avy-goto-line
    <span class="org-string">"gs"</span> 'avy-goto-char-timer)
  (evil-define-key 'visual 'global
    <span class="org-string">"s"</span> 'avy-goto-char-2
    <span class="org-string">"S"</span> 'avy-goto-line)
  (evil-define-key 'operator 'global
    <span class="org-string">"s"</span> 'avy-goto-char-2)

  (<span class="org-keyword">setq</span> avy-background t)
  (<span class="org-keyword">setq</span> avy-style 'at-full)
  (<span class="org-keyword">setq</span> avy-timeout-seconds 0.3))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgba1cfd2" class="outline-2">
<h2 id="orgba1cfd2"><span class="section-number-2">6.</span> File Explorer</h2>
<div class="outline-text-2" id="text-6">
<p>
Dired or Treemacs toggle with <code>&lt;leader&gt;e</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Toggle file explorer (like Neovim &lt;leader&gt;e for Neo-tree)
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">(my/leader-keys
</span><span class="org-comment-delimiter">;;   </span><span class="org-comment">"e" '(dired-jump :which-key "file explorer"))
</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">If you prefer treemacs, uncomment:
</span>(<span class="org-keyword">use-package</span> treemacs-evil
  <span class="org-builtin">:after</span> (treemacs evil)
  <span class="org-builtin">:ensure</span> t)
(my/leader-keys
  <span class="org-string">"e"</span> '(treemacs <span class="org-builtin">:which-key</span> <span class="org-string">"file explorer"</span>))
</pre>
</div>
</div>
</div>
