content/emacs/configs/14-evil.org
* Terminal Toggle

Floating/popup terminal like your Neovim config.

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/evil-conf.el
;; Simple popup terminal (like Neovim <leader>`)
(defun my/toggle-popup-term ()
  "Toggle a popup terminal buffer."
  (interactive)
  (let ((term-buf (get-buffer "*popup-term*")))
    (if (and term-buf (get-buffer-window term-buf))
        (delete-window (get-buffer-window term-buf))
      (if term-buf
          (pop-to-buffer term-buf
                         '((display-buffer-at-bottom)
                           (window-height . 0.3)))
        (let ((buf (get-buffer-create "*popup-term*")))
          (pop-to-buffer buf
                         '((display-buffer-at-bottom)
                           (window-height . 0.3)))
          (unless (derived-mode-p 'term-mode 'vterm-mode 'eshell-mode)
            (eshell)))))))

(my/leader-keys
  "`" '(my/toggle-popup-term :which-key "terminal"))

;; Terminal modes use emacs state, so no evil keybindings needed
;; See evil-set-initial-state settings in Evil Core section
#+end_src

* Project Management

Projectile-style bindings with =<leader>p=.

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/evil-conf.el
;; Project commands (requires project.el or projectile)
(my/leader-keys
  "p" '(:ignore t :which-key "project")
  "pf" '(project-find-file :which-key "find file")
  "pg" '(project-find-regexp :which-key "grep")
  "pb" '(project-switch-to-buffer :which-key "buffers")
  "pd" '(project-dired :which-key "dired")
  "pp" '(project-switch-project :which-key "switch project")
  "pk" '(project-kill-buffers :which-key "kill buffers"))
#+end_src

* Git Integration

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/evil-conf.el
(my/leader-keys
  "g" '(:ignore t :which-key "git")
  "gs" '(magit-status :which-key "status")
  "gb" '(magit-blame :which-key "blame")
  "gl" '(magit-log-current :which-key "log")
  "gd" '(magit-diff :which-key "diff")
  "gf" '(magit-fetch :which-key "fetch")
  "gp" '(magit-push :which-key "push")
  "gP" '(magit-pull :which-key "pull"))
#+end_src

* Provide Feature

#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/evil-conf.el
(provide 'evil-conf)
;;; evil-conf.el ends here
#+end_src

* Usage

To test this configuration:

1. *Evaluate the whole buffer*:
   #+begin_example
   M-x org-babel-execute-buffer
   #+end_example

2. *Tangle to elisp file*:
   #+begin_example
   C-c C-v t
   #+end_example
   This creates =~/.emacs.d/elisp/settings/evil-conf.el=

3. *Add to your config* (if keeping):
   Add this line to your =init.el= after other requires:
   #+begin_src emacs-lisp :tangle no
   (require 'evil-conf)
   #+end_src

* Key Reference

| Neovim          | Evil (Emacs) | Description                |
|-----------------+--------------+----------------------------|
| =<leader>=        | =SPC=          | Leader key                 |
| =<leader>]=       | =SPC ]=        | Next buffer                |
| =<leader>[=       | =SPC [=        | Previous buffer            |
| =<leader>k=       | =SPC k=        | Kill buffer                |
| =<leader>ff=      | =SPC f f=      | Find file                  |
| =<leader>fg=      | =SPC s g=      | Live grep (ripgrep)        |
| =<leader>bb=      | =SPC b b=      | Switch buffer              |
| =<leader>e=       | =SPC e=        | File explorer              |
| =<leader>`=       | =SPC `=        | Toggle terminal            |
| =<leader>c=       | =SPC h=        | Clear search highlight     |
| =<leader>\vert{}= | =SPC \vert{}=  | Vertical split             |
| =<leader>_=       | =SPC _=        | Horizontal split           |
| =<leader>1=       | =SPC 1=        | Close other windows        |
| =gd=              | =gd=           | Go to definition           |
| =gr=              | =gr=           | Go to references           |
| =K=               | =K=            | Hover documentation        |
| =]d=              | =]d=           | Next diagnostic            |
| =[d=              | =[d=           | Previous diagnostic        |
| =s=               | =s=            | Leap/Avy forward           |
| =S=               | =S=            | Leap/Avy line              |
| =gcc=             | =gcc=          | Comment line               |
| =gc=              | =gc=           | Comment motion             |
| =cs"'=            | =cs"'=         | Change surrounding         |
| =ys)=             | =ys)=          | Add surrounding            |
| =M-j= / =M-k=       | =M-j= / =M-k=    | Move line down/up          |
| =jj= / =jk=         | =jj= / =jk=      | Exit insert mode           |
| =C-a= / =C-x=       | =C-a= / =C-x=    | Increment/decrement number |
