emacs/configs/14-evil.html

<div id="outline-container-org2596bbb" class="outline-2">
<h2 id="org2596bbb"><span class="section-number-2">7.</span> Terminal Toggle</h2>
<div class="outline-text-2" id="text-7">
<p>
Floating/popup terminal like your Neovim config.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Simple popup terminal (like Neovim &lt;leader&gt;`)
</span>(<span class="org-keyword">defun</span> <span class="org-function-name">my/toggle-popup-term</span> ()
  <span class="org-doc">"Toggle a popup terminal buffer."</span>
  (<span class="org-keyword">interactive</span>)
  (<span class="org-keyword">let</span> ((term-buf (get-buffer <span class="org-string">"*popup-term*"</span>)))
    (<span class="org-keyword">if</span> (<span class="org-keyword">and</span> term-buf (get-buffer-window term-buf))
        (delete-window (get-buffer-window term-buf))
      (<span class="org-keyword">if</span> term-buf
          (pop-to-buffer term-buf
                         '((display-buffer-at-bottom)
                           (window-height . 0.3)))
        (<span class="org-keyword">let</span> ((buf (get-buffer-create <span class="org-string">"*popup-term*"</span>)))
          (pop-to-buffer buf
                         '((display-buffer-at-bottom)
                           (window-height . 0.3)))
          (<span class="org-keyword">unless</span> (derived-mode-p 'term-mode 'vterm-mode 'eshell-mode)
            (eshell)))))))

(my/leader-keys
  <span class="org-string">"`"</span> '(my/toggle-popup-term <span class="org-builtin">:which-key</span> <span class="org-string">"terminal"</span>))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Terminal modes use emacs state, so no evil keybindings needed
</span><span class="org-comment-delimiter">;; </span><span class="org-comment">See evil-set-initial-state settings in Evil Core section</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga9e1a36" class="outline-2">
<h2 id="orga9e1a36"><span class="section-number-2">8.</span> Project Management</h2>
<div class="outline-text-2" id="text-8">
<p>
Projectile-style bindings with <code>&lt;leader&gt;p</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">Project commands (requires project.el or projectile)
</span>(my/leader-keys
  <span class="org-string">"p"</span> '(<span class="org-builtin">:ignore</span> t <span class="org-builtin">:which-key</span> <span class="org-string">"project"</span>)
  <span class="org-string">"pf"</span> '(project-find-file <span class="org-builtin">:which-key</span> <span class="org-string">"find file"</span>)
  <span class="org-string">"pg"</span> '(project-find-regexp <span class="org-builtin">:which-key</span> <span class="org-string">"grep"</span>)
  <span class="org-string">"pb"</span> '(project-switch-to-buffer <span class="org-builtin">:which-key</span> <span class="org-string">"buffers"</span>)
  <span class="org-string">"pd"</span> '(project-dired <span class="org-builtin">:which-key</span> <span class="org-string">"dired"</span>)
  <span class="org-string">"pp"</span> '(project-switch-project <span class="org-builtin">:which-key</span> <span class="org-string">"switch project"</span>)
  <span class="org-string">"pk"</span> '(project-kill-buffers <span class="org-builtin">:which-key</span> <span class="org-string">"kill buffers"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb7cfa73" class="outline-2">
<h2 id="orgb7cfa73"><span class="section-number-2">9.</span> Git Integration</h2>
<div class="outline-text-2" id="text-9">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(my/leader-keys
  <span class="org-string">"g"</span> '(<span class="org-builtin">:ignore</span> t <span class="org-builtin">:which-key</span> <span class="org-string">"git"</span>)
  <span class="org-string">"gs"</span> '(magit-status <span class="org-builtin">:which-key</span> <span class="org-string">"status"</span>)
  <span class="org-string">"gb"</span> '(magit-blame <span class="org-builtin">:which-key</span> <span class="org-string">"blame"</span>)
  <span class="org-string">"gl"</span> '(magit-log-current <span class="org-builtin">:which-key</span> <span class="org-string">"log"</span>)
  <span class="org-string">"gd"</span> '(magit-diff <span class="org-builtin">:which-key</span> <span class="org-string">"diff"</span>)
  <span class="org-string">"gf"</span> '(magit-fetch <span class="org-builtin">:which-key</span> <span class="org-string">"fetch"</span>)
  <span class="org-string">"gp"</span> '(magit-push <span class="org-builtin">:which-key</span> <span class="org-string">"push"</span>)
  <span class="org-string">"gP"</span> '(magit-pull <span class="org-builtin">:which-key</span> <span class="org-string">"pull"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-orge3d6f35" class="outline-2">
<h2 id="orge3d6f35"><span class="section-number-2">10.</span> Provide Feature</h2>
<div class="outline-text-2" id="text-10">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">provide</span> '<span class="org-constant">evil-conf</span>)
<span class="org-comment-delimiter">;;; </span><span class="org-comment">evil-conf.el ends here</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb96f58c" class="outline-2">
<h2 id="orgb96f58c"><span class="section-number-2">11.</span> Usage</h2>
<div class="outline-text-2" id="text-11">
<p>
To test this configuration:
</p>

<ol class="org-ol">
<li><p>
<b>Evaluate the whole buffer</b>:
</p>
<pre class="example" id="org13c1092">
M-x org-babel-execute-buffer
</pre></li>

<li><p>
<b>Tangle to elisp file</b>:
</p>
<pre class="example" id="org63bf00b">
C-c C-v t
</pre>
<p>
This creates <code>~/.emacs.d/elisp/settings/evil-conf.el</code>
</p></li>

<li><p>
<b>Add to your config</b> (if keeping):
Add this line to your <code>init.el</code> after other requires:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span class="org-keyword">require</span> '<span class="org-constant">evil-conf</span>)
</pre>
</div></li>
</ol>
</div>
</div>

<div id="outline-container-org7ab4ca4" class="outline-2">
<h2 id="org7ab4ca4"><span class="section-number-2">12.</span> Key Reference</h2>
<div class="outline-text-2" id="text-12">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Neovim</th>
<th scope="col" class="org-left">Evil (Emacs)</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>&lt;leader&gt;</code></td>
<td class="org-left"><code>SPC</code></td>
<td class="org-left">Leader key</td>
</tr>

<tr>
<td class="org-left"><code>&lt;leader&gt;]</code></td>
<td class="org-left"><code>SPC ]</code></td>
<td class="org-left">Next buffer</td>
</tr>

<tr>
<td class="org-left"><code>&lt;leader&gt;[</code></td>
<td class="org-left"><code>SPC [</code></td>
<td class="org-left">Previous buffer</td>
</tr>

<tr>
<td class="org-left"><code>&lt;leader&gt;k</code></td>
<td class="org-left"><code>SPC k</code></td>
<td class="org-left">Kill buffer</td>
</tr>

<tr>
<td class="org-left"><code>&lt;leader&gt;ff</code></td>
<td class="org-left"><code>SPC f f</code></td>
<td class="org-left">Find file</td>
</tr>

<tr>
<td class="org-left"><code>&lt;leader&gt;fg</code></td>
<td class="org-left"><code>SPC s g</code></td>
<td class="org-left">Live grep (ripgrep)</td>
</tr>

<tr>
<td class="org-left"><code>&lt;leader&gt;bb</code></td>
<td class="org-left"><code>SPC b b</code></td>
<td class="org-left">Switch buffer</td>
</tr>

<tr>
<td class="org-left"><code>&lt;leader&gt;e</code></td>
<td class="org-left"><code>SPC e</code></td>
<td class="org-left">File explorer</td>
</tr>

<tr>
<td class="org-left"><code>&lt;leader&gt;`</code></td>
<td class="org-left"><code>SPC `</code></td>
<td class="org-left">Toggle terminal</td>
</tr>

<tr>
<td class="org-left"><code>&lt;leader&gt;c</code></td>
<td class="org-left"><code>SPC h</code></td>
<td class="org-left">Clear search highlight</td>
</tr>

<tr>
<td class="org-left"><code>&lt;leader&gt;\vert{}</code></td>
<td class="org-left"><code>SPC \vert{}</code></td>
<td class="org-left">Vertical split</td>
</tr>

<tr>
<td class="org-left"><code>&lt;leader&gt;_</code></td>
<td class="org-left"><code>SPC _</code></td>
<td class="org-left">Horizontal split</td>
</tr>

<tr>
<td class="org-left"><code>&lt;leader&gt;1</code></td>
<td class="org-left"><code>SPC 1</code></td>
<td class="org-left">Close other windows</td>
</tr>

<tr>
<td class="org-left"><code>gd</code></td>
<td class="org-left"><code>gd</code></td>
<td class="org-left">Go to definition</td>
</tr>

<tr>
<td class="org-left"><code>gr</code></td>
<td class="org-left"><code>gr</code></td>
<td class="org-left">Go to references</td>
</tr>

<tr>
<td class="org-left"><code>K</code></td>
<td class="org-left"><code>K</code></td>
<td class="org-left">Hover documentation</td>
</tr>

<tr>
<td class="org-left"><code>]d</code></td>
<td class="org-left"><code>]d</code></td>
<td class="org-left">Next diagnostic</td>
</tr>

<tr>
<td class="org-left"><code>[d</code></td>
<td class="org-left"><code>[d</code></td>
<td class="org-left">Previous diagnostic</td>
</tr>

<tr>
<td class="org-left"><code>s</code></td>
<td class="org-left"><code>s</code></td>
<td class="org-left">Leap/Avy forward</td>
</tr>

<tr>
<td class="org-left"><code>S</code></td>
<td class="org-left"><code>S</code></td>
<td class="org-left">Leap/Avy line</td>
</tr>

<tr>
<td class="org-left"><code>gcc</code></td>
<td class="org-left"><code>gcc</code></td>
<td class="org-left">Comment line</td>
</tr>

<tr>
<td class="org-left"><code>gc</code></td>
<td class="org-left"><code>gc</code></td>
<td class="org-left">Comment motion</td>
</tr>

<tr>
<td class="org-left"><code>cs"'</code></td>
<td class="org-left"><code>cs"'</code></td>
<td class="org-left">Change surrounding</td>
</tr>

<tr>
<td class="org-left"><code>ys)</code></td>
<td class="org-left"><code>ys)</code></td>
<td class="org-left">Add surrounding</td>
</tr>

<tr>
<td class="org-left"><code>M-j</code> / <code>M-k</code></td>
<td class="org-left"><code>M-j</code> / <code>M-k</code></td>
<td class="org-left">Move line down/up</td>
</tr>

<tr>
<td class="org-left"><code>jj</code> / <code>jk</code></td>
<td class="org-left"><code>jj</code> / <code>jk</code></td>
<td class="org-left">Exit insert mode</td>
</tr>

<tr>
<td class="org-left"><code>C-a</code> / <code>C-x</code></td>
<td class="org-left"><code>C-a</code> / <code>C-x</code></td>
<td class="org-left">Increment/decrement number</td>
</tr>
</tbody>
</table>
</div>
</div>
</main>
</body>
</html>
